ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_hrpwmcal_regs.xml
<module id="HRPWMCAL_REGS" HW_revision="" description="HRPWMCAL Registers">
	<register id="HRPWR" width="16" page="0" offset="0x42" instances="1" instaddr="2" internal="0" description="HRPWM Power Register">
		<bitfield id="CALPWRON" description="Calibration Power On" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="HRMSTEP" width="16" page="0" offset="0x4c" instances="1" instaddr="2" internal="0" description="HRPWM MEP Step Register">
		<bitfield id="HRMSTEP" description="High Resolution Micro Step Value" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
</module>
